app/Controllers/Home.php

    public function index()
    {
        $tab_usuario = new UsuarioModel();
        $tab_area = new AreaModel();

        $fa = date('Y-m-d');

        $are = $this->request->getGet('a');
        $query = $this->db->query("SELECT *
            FROM asistencia a
            INNER JOIN usuario u ON u.usu_id = a.usu_id
            WHERE a.asi_fecha = '$fa'
            ORDER BY a.asi_id DESC ");
        $dato_usuario = $query->getResultArray();

        $dato_area = $tab_area->findAll();
---
SELECT *
FROM `area`

    public function panel(){
        $tab_usuario = new UsuarioModel();
        $tab_asistencia = new AsistenciaModel();
        $pag = ['pag' => 'pri'];

        $are = session('are');

        //llamar usuarios
            $dato_usuario = $tab_usuario->where('usu_tipo', 2)->orderBy('usu_id', 'desc')->findAll();
---
SELECT *
FROM `usuario`
WHERE `usu_tipo` = 2
ORDER BY `usu_id` DESC

    public function usuario(){
        $tab_area = new AreaModel();
        $tab_usuario = new UsuarioModel();
        $tab_institucion = new InstitucionModel();
        $pag = ['pag' => 'usu'];

        if (session('are') != '1') {
            $are = session('are');
            $query = $this->db->query("SELECT u.*, a.are_nombre, i.ins_nombre
                FROM usuario u
                INNER JOIN area a ON a.are_id = u.are_id
                INNER JOIN institucion i ON i.ins_id = u.ins_id
                WHERE u.usu_tipo != 1 AND u.usu_tipo != 3 AND u.are_id = $are
                ORDER BY u.usu_id desc"
            );
        }else{
            $query = $this->db->query("SELECT u.*, a.are_nombre, i.ins_nombre
                FROM usuario u
                INNER JOIN area a ON a.are_id = u.are_id
                INNER JOIN institucion i ON i.ins_id = u.ins_id
                WHERE usu_tipo != 1 AND usu_tipo != 3
                ORDER BY u.usu_id desc"
            );
        }

        $dato_usuario = $query->getResultArray();

        $dato_area = $tab_area->where('are_estado', 1)->orderBy('are_id', 'asc')->findAll();
        $dato_institucion = $tab_institucion->where('ins_estado', 1)->orderBy('ins_nombre', 'asc')->findAll();
---
SELECT *
FROM `area`
WHERE `are_estado` = 1
ORDER BY `are_id` ASC
SELECT *
FROM `institucion`
WHERE `ins_estado` = 1
ORDER BY `ins_nombre` ASC